/** \mainpage
1. ОБЩИЕ СВЕДЕНИЯ \n
ASSInterface – содержит описание всех интерфейсов и не компиллируется в отдельный dll или lib файл.\n
Данный проек состоит из заголовочных файлов и служит для прозрачности разработки и удобства взаимодействия всех модулей лингвистического отдела. \n
Проект реализован на языке программирования C++ с использованием инструментальных средств из среды разработки Microsoft Visual Studio .Net, библиотеки STL \n
\n
2. ФУНКЦИОНАЛЬНОЕ НАЗНАЧЕНИЕ \n
Данный модуль решает следующие задачи:\n
•	Содержит описание внутренних всех интерфейсов лингвистического отдела.\n
•	Позволяет упростить процесс разработки всех модулей лингвистического отдела.\n
\n

3. ИСПОЛЬЗУЕМЫЕ ТЕХНИЧЕСКИЕ СРЕДСТВА \n
Используется стандартная техническая база, на которую может быть установлена ОС Windows. \n
\n
4. ВЫЗОВ И ЗАГРУЗКА \n
4.1. Модуль не загружается. \n


5. ТЕХНИЧЕСКИЕ ОСОБЕННОСТИ   \n
*/

