/** \mainpage
<b>1. ОБЩИЕ СВЕДЕНИЯ</b>\n
Модуль ASCInterface используется для хранения описаний интерфейсов, типов и макросов, предоставляемых/используемых модулями неуправляемого кода и используемых модулями, 
разрабатываемыми как в лингвистическом отделе, так и в отделе информационно-поисковых систем. \n
Модуль является чисто библиотекой программного кода, написанного на языке С++.\n
Данный модуль не участвует в компиляции (байт-код не формируется), однако в других модулях используются заголовочные файлы, содержащиеся в данном модуле.\n

<b>2. ФУНКЦИОНАЛЬНОЕ НАЗНАЧЕНИЕ</b>\n
Данный модуль решает следующие задачи:
\li	Хранение описаний интерфейсов, типов и макросов, используемых модулями как лингвистического отдела, так и отдела информационно-поисковых систем.

<b>3. ОПИСАНИЕ ЛОГИЧЕСКОЙ СТРУКТУРЫ</b>\n
Данный модуль содержит только описание интерфейсов, типов (в том числе и классов-типов) и макросов. Для удобства все описания распределены по код-файлам, названным
по имени интерфейса или группы интерфейсов или типов. 

<b>4. ИСПОЛЬЗУЕМЫЕ ТЕХНИЧЕСКИЕ СРЕДСТВА</b>\n
Отсутствуют.

<b>5. ВЫЗОВ И ЗАГРУЗКА</b>\n
Отсутствует, так как модуль не содержит исполняемого кода.

<b>6. ВХОДНЫЕ ДАННЫЕ</b>\n
Отсутствуют, так как модуль не содержит исполняемого кода.

<b>7. ВЫХОДНЫЕ ДАННЫЕ</b>\n
Отсутствуют, так как модуль не содержит исполняемого кода.

*/